/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "static-article",
      "custom_css": [
        "@media (min-width: 767px) {.article-image--content-width {background-color: white; background-size: contain !important; background-repeat: no-repeat; background-position: center center; height: auto !important; aspect-ratio: auto; min-height: 800px; }}"
      ],
      "settings": {
        "featured_image_width": "content-width",
        "show_date": true,
        "show_author": true,
        "use_share_buttons": true
      }
    },
    "dynamic_custom_liquid_BJY93w": {
      "type": "dynamic-custom-liquid",
      "name": "t:sections.custom_liquid.presets.custom_liquid.name",
      "settings": {
        "custom_liquid": "<script type=\"application/ld+json\">\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What are the main benefits of LED trailer lights?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"LED trailer lights offer a longer lifespan, are more energy-efficient, and provide brighter, more noticeable light compared to traditional incandescent bulbs. This improves safety and reduces the need for frequent maintenance.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Are submersible trailer lights waterproof?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Yes, submersible trailer lights are fully waterproof and specifically designed to withstand being submerged in water when launching or retrieving a boat. They are sealed to prevent corrosion and electrical issues.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Do your trailer lights meet legal requirements?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Yes, all of our trailer lights are DOT (Department of Transportation) compliant. This means they meet the federal safety standards required for legal use on roads and highways.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What does a trailer lights kit include?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"A typical trailer lights kit includes a pair of tail lights (often LED), a pre-wired harness for easy connection, and the necessary mounting hardware. These kits provide a complete solution for new installations or full lighting upgrades.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"How do I choose the right lights for my boat trailer?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"For boat trailers, it's essential to choose lights that are waterproof and corrosion-resistant. Our submersible trailer lights and LED boat trailer lights are designed specifically for the wet and harsh marine environment.\"\n      }\n    }\n  ]\n}\n</script>"
      }
    }
  },
  "order": [
    "main",
    "dynamic_custom_liquid_BJY93w"
  ]
}
