/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "static-article",
      "custom_css": [
        "@media (min-width: 767px) {.article-image--content-width {background-color: white; background-size: contain !important; background-repeat: no-repeat; background-position: center center; height: auto !important; aspect-ratio: auto; min-height: 800px; }}"
      ],
      "settings": {
        "featured_image_width": "content-width",
        "show_date": true,
        "show_author": true,
        "use_share_buttons": true
      }
    },
    "dynamic_custom_liquid_rgJEyL": {
      "type": "dynamic-custom-liquid",
      "name": "t:sections.custom_liquid.presets.custom_liquid.name",
      "settings": {
        "custom_liquid": "<script type=\"application/ld+json\">\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Are daytime running lights the same as headlights?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"No, they are not. While both are front-facing lights, their purpose and intensity are very different. Headlights are designed to illuminate the road ahead for the driver, while DRLs are much less bright and are specifically designed to make the vehicle more visible to other road users. In most regions, DRLs do not meet the legal requirements for driving in low-light or nighttime conditions.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Do DRLs use a lot of power or drain the car battery?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Modern daytime running lights, especially LED DRLs, are highly energy-efficient. Their power consumption is minimal and has a negligible impact on a vehicle's fuel economy or battery life. The minimal energy cost is far outweighed by the significant safety benefits they provide.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Can I install DRLs on my older car?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Yes, you can. Many older vehicles can be retrofitted with aftermarket DRL systems. It's important to choose a high-quality kit and, if you're not comfortable with electrical work, have it professionally installed to ensure it functions correctly and complies with local regulations.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"What are the legal requirements for DRLs?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Regulations for DRLs vary significantly by country and even by state or province. In places like Canada and the European Union, DRLs are mandatory on all new vehicles. In the United States, they are permitted but not required by federal law. Always check your local and regional laws to ensure your DRLs are compliant regarding brightness, color, and function.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Do DRLs make motorcycles less visible?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"This is a common concern, but studies have not found a direct link between the use of DRLs on cars and a decrease in motorcycle visibility. Many modern motorcycles are also equipped with DRLs to maintain their conspicuousness. The overall increase in road awareness from widespread DRL use benefits all road users, including motorcyclists.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Do I need to turn on my headlights if my DRLs are on?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Yes, you should. DRLs are not a substitute for headlights. You should always turn on your main headlights in low-light conditions, such as at dusk or dawn, in bad weather (rain, fog), or at night. Relying solely on DRLs in these conditions is not only unsafe but may also be illegal, as DRLs often don't activate a vehicle's taillights.\"\n      }\n    }\n  ]\n}\n</script>"
      }
    }
  },
  "order": [
    "main",
    "dynamic_custom_liquid_rgJEyL"
  ]
}
